tap "buo/cask-upgrade"
tap "homebrew/bundle"
tap "kong/deck"
brew "awscli"
brew "bash"
brew "bash-completion@2"
brew "cmatrix"
brew "colima"
brew "container"
brew "cowsay"
brew "docker"
brew "docker-compose"
brew "fastfetch"
brew "fortune"
brew "fzf"
brew "gnupg"
brew "helm"
brew "httpie"
brew "ipcalc"
brew "kubernetes-cli"
brew "lolcat"
brew "magic-wormhole"
brew "node"
brew "openshift-cli"
brew "opentofu"
brew "pandoc"
brew "rename"
brew "shellcheck"
brew "shfmt"
brew "speedtest-cli"
brew "starship"
brew "tmux"
brew "tree"
brew "uv"
brew "watch"
brew "yq"
brew "kong/deck/deck"
cask "alacritty"
cask "bitwarden"
cask "brave-browser"
cask "chatgpt"
cask "claude-code"
cask "codex"
cask "codex-app"
cask "ente-auth"
cask "firefox"
cask "hiddenbar"
cask "home-assistant"
cask "insomnia"
cask "itsycal"
cask "logi-options+"
cask "netnewswire"
cask "rectangle"
cask "sf-symbols"
cask "signal"
cask "spotify"
cask "stats"
cask "ticktick"
cask "utm"
cask "visual-studio-code"
cask "windows-app"
vscode "anthropic.claude-code"
vscode "github.copilot-chat"
vscode "hashicorp.terraform"
vscode "mermaidchart.vscode-mermaid-chart"
vscode "ms-python.debugpy"
vscode "ms-python.python"
vscode "ms-python.vscode-pylance"
vscode "ms-python.vscode-python-envs"
vscode "ms-vscode-remote.remote-ssh"
vscode "ms-vscode-remote.remote-ssh-edit"
vscode "ms-vscode.remote-explorer"
vscode "ms-vscode.vscode-speech"
vscode "openai.chatgpt"
vscode "pomdtr.excalidraw-editor"
vscode "redhat.ansible"
vscode "redhat.vscode-yaml"
vscode "streetsidesoftware.code-spell-checker"
